package com.example.deasa12.`object`.dataList

import com.example.deasa12.models.Queue
import com.example.deasa12.models.Teams


object DataList {
    val teamList = mutableListOf(
        Teams(0, "Team 1", 0),
        Teams(1, "Team 2", 0)
    )

    val tempList = mutableListOf<String>()

    //    val teamPointList = mutableListOf<Point>()
    val queueList = mutableListOf<Queue>(
        Queue(1)
    )


    val singerList =
        mutableListOf("Արմո", "Սերժ Թանկյան", "Հայկո", "Ռուբեն Հախվերդիան", "Сосо Павлиашвили",
            "Շառլ Ազնավուր", "Eminem", "Գոռ Հակոբյան", "Մարտին Մկրտչյան", "Michael Jecson",
            "Գևորգ Մարտիրոսյան", "Գոշ Հակոբյան", "Սիրուշո", "Էրիկ Կարապետյան", "Արմենչիկ",
            "Արկադի Դումիկյան", "Ալլա Լևոնյան", "Shakira", "Արսեն Գրիգորյան", "Նունե Եսայան",
        "Серебро", "Տիգրան Ասատրյան", "Lady Gaga", "Լիդուշիկ", "Լիլիթ Հովհանիսյան", "Тимати",
        "Արամ  MP3", "Գրիգորի Եսայան", "Սարո", "Հռիփսիմե Հակոբյան", "Алла Пугачова",
            "Իվետա Մուկուչյան", "Ирина Алегрова", "Enrique Iglesias", "Արսեն Սաֆարյան",
        "Григори Лепс", "Լիլիթ Կարապետյան", "Շպռոտ", "Մհեր Արմենիա", "Ինգա Անուշ Արշակյաններ",
        "Արրա Մարտիրոսյան", "Սուպեր Սաքո", "Թաթա Սիմոնյան", "Միշո", "Արամ Ասատրյան", "Անահիտ Սիմոնյան",
        "Ռազմիկ Ամյան", "Լիլու", "Սևակ Ամրոյան", "Սիլվա Հակոբյան", "Սոֆի Մխեյան", "Սևակ Խանաղյան",
        "MiyaGi", "Հարութ Փամբուկչյան", "Արման Հովհանիսյան", "Սոնա Շահգելդյան", "Վաչե Ամարյան",
        "Անդրե", "Ռեկարնացիա", "Արտաշ ԱՍատրյան", "Սպիտակցի Հայկո", "Անդի", "Հասմիկ Կարապետյան",
        "Ֆորշ", "Սոնա Ռուբենյան", "Միհրան Ծառուկյան", "Վարդան Սարգսյան", "Մարտին Յորգանց", "Բղդո",
        "Արտո Թուջբոյաջյան", "Արամե", "Քրիստինե Պեպելյան", "Աիդա Սարգսյան", "Եվա Ռիվաս", "Գոռ Սուջյան",
        "Abba", "Անուշ Պետրոսյան", "Արտաշ Ասատրյան", "Վարդան Ուրումյան", "3.33", "Մի քանի հոքի",
        "Առման Թովմասյան", "Հովո", "Տաթև Ասատրյան", "Սարգիս Ավետիսյան", "Սարգիս Եղիազարյան",
        "Նարեկ Բավեյան", "ՎնասաԿար", "Անետե Աղաբեկյան", "Արթուր Առաքելյան", "Ռավո Խաչատրյան",
        "Արա Ալիկ", "Օքսի Ավդալյան", "Գևորգ Սիրեկանյան", "Գոռ Երեմյան", "Զոյա Բառառամյան",
        "Jah Kalib", "Մաշ Իսրաելյան", "խչո", "Գայա Աբհրամյան", "Գայա Արզումանյան", "Գուրգեն Դաբաղյան")
}